---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ToggleViewFailures
source: html/dea06374-558b-5b6a-b291-91dd9ddd2948.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ToggleViewFailures

Failures about ToggleView.

## Syntax (C#)
```csharp
public static class ToggleViewFailures
```